# Чтобы вызвать функцию нужно написать def function_name():

# def function_name():
    # Дальше идет тело функции.
    # print("Hello World")

# Есть возвратные и не возвратные функции.

# function_name()

# function_name это не возвратная функция, а точнее функция-процедура.

# Процедура - вызивается ради побочного эффекта.
# Побочный эффект - у function_name() побочный эффект это вывод текста.

# Для того чтобы передать какую нибуть инфу в функцию используют - Параметр функции.
# P.S. Она в скобках.

# name = input("Как твоё имя? ")
# def function_name_2(name):
#     print(f"Привет {name}")
#
# function_name_2(name)

# ada = int(input())
# def num(num):
#     print(num * 1.8 + 32)
# num(ada)