# num = int(input())
# num12 = int(input())
#
#
# def calc(a1, a2):
#     print(a1 + a2)
#     print(a1 - a2)
#     print(a1 * a2)
#     print(a1 / a2)
#
# calc(num, num12)

warrior = {'здоровье': 100, 'атака': 30, 'защита': 25, 'навыки': {'щит': 10}}
archer = {'здоровье': 50, 'атака': 40, 'защита': 20, 'навыки': {'убежать': 10}, 'инвентарь': ['стрелы', 'меч', 'еда']}
wizard = {'здоровье': 30, 'атака': 50, 'защита': 15, 'навыки': {'магический щит': 10, 'лечение': 5}}


def print_dict(a1): # Продолжи писать решение
    pass


# Не удаляй этот код, он нужен для тестирования
# for item in[warrior, archer, wizard]:
#     print_dict(item)

warrior = {'здоровье': 100, 'атака': 30, 'защита': 25, 'навыки': {'щит': 10}}
archer = {'здоровье': 50, 'атака': 40, 'защита': 20, 'навыки': {'убежать': 10}, 'инвентарь': ['стрелы', 'меч', 'еда']}
wizard = {'здоровье': 30, 'атака': 50, 'защита': 15, 'навыки': {'магический щит': 10, 'лечение': 5}}
def print_dict(item):  # Продолжи писать решение
    for items in item.items():
        print(f"{items[0]}: {items[1]}")



# Не удаляй этот код, он нужен для тестирования
for item in [warrior, archer, wizard]:
    print_dict(item)